index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />

</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orge0478e1">1. Articles</a>
<ul>
<li><a href="#org0c522b9">1.1. Greatest convex minorant / least concave majorant</a></li>
</ul>
</li>
<li><a href="#org13068b9">2. Julia packages</a>
<ul>
<li><a href="#org93ce4d9">2.1. Whitening.jl</a></li>
<li><a href="#org7a9bf2e">2.2. OptimizationTestFunctions.jl</a></li>
<li><a href="#org8a7dbfa">2.3. LogExpFunctionsExt.jl</a></li>
<li><a href="#org9b7bd3e">2.4. MarsagliaDiscreteSamplers.jl</a></li>
<li><a href="#org51dc191">2.5. CategoricalMonteCarlo.jl</a></li>
<li><a href="#orgbf12372">2.6. VectorizedReduction.jl</a></li>
<li><a href="#orgfb9475f">2.7. RecursiveTiles.jl</a></li>
<li><a href="#orgb1aa2c3">2.8. MonteCarloSummary.jl</a></li>
</ul>
</li>
<li><a href="#org29abe9e">3. Rust crates</a>
<ul>
<li><a href="#org3e36fac">3.1. lnexp</a></li>
<li><a href="#org9c742d2">3.2. logsumexp</a></li>
<li><a href="#org900c328">3.3. gcm-lcm</a></li>
<li><a href="#org675b5e6">3.4. horner-eval</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
Might be of interest?
</p>
<div id="outline-container-orge0478e1" class="outline-2">
<h2 id="orge0478e1"><span class="section-number-2">1.</span> Articles</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org0c522b9" class="outline-3">
<h3 id="org0c522b9"><span class="section-number-3">1.1.</span> Greatest convex minorant / least concave majorant</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Currently in <a href="gcm-algorithm.pdf">pre-pre-print</a> stage, but the idea is crystallized.  More
will be added (e.g. online algorithm), but in order to get it on
<code>crates.io</code> sooner rather than later, while providing users a rigorous
foundation, I opt for release here.  This needs endorsement prior to
submission to <code>arXiv.org</code>. When that happens, the link will be updated
to point there.
</p>
</div>
</div>
</div>

<div id="outline-container-org13068b9" class="outline-2">
<h2 id="org13068b9"><span class="section-number-2">2.</span> Julia packages</h2>
<div class="outline-text-2" id="text-2">
<p>
The useful ones
</p>
</div>
<div id="outline-container-org93ce4d9" class="outline-3">
<h3 id="org93ce4d9"><span class="section-number-3">2.1.</span> <a href="https://github.com/andrewjradcliffe/Whitening.jl">Whitening.jl</a></h3>
<div class="outline-text-3" id="text-2-1">
<p>
Whitening transformations: forward and inverse. Lightweight, with no
dependencies other than <code>LinearAlgebra</code> stdlib.
</p>
</div>
</div>
<div id="outline-container-org7a9bf2e" class="outline-3">
<h3 id="org7a9bf2e"><span class="section-number-3">2.2.</span> <a href="https://github.com/andrewjradcliffe/OptimizationTestFunctions.jl">OptimizationTestFunctions.jl</a></h3>
<div class="outline-text-3" id="text-2-2">
<p>
A wide variety of functions, \(f : \mathbb{R}^{n} \mapsto \mathbb{R}\),
which are most frequently used to test mathematical optimization
algorithms. Also handy for testing automatic differentiation
implementations.
</p>
</div>
</div>
<div id="outline-container-org8a7dbfa" class="outline-3">
<h3 id="org8a7dbfa"><span class="section-number-3">2.3.</span> <a href="https://github.com/andrewjradcliffe/LogExpFunctionsExt.jl">LogExpFunctionsExt.jl</a></h3>
<div class="outline-text-3" id="text-2-3">
<p>
Lightweight, sensible extensions to the <a href="https://github.com/JuliaStats/LogExpFunctions.jl">LogExpFunctions.jl</a> package.
</p>
</div>
</div>
<div id="outline-container-org9b7bd3e" class="outline-3">
<h3 id="org9b7bd3e"><span class="section-number-3">2.4.</span> <a href="https://github.com/andrewjradcliffe/MarsagliaDiscreteSamplers.jl">MarsagliaDiscreteSamplers.jl</a></h3>
<div class="outline-text-3" id="text-2-4">
<p>
Very fast samplers for discrete probability distributions.
</p>
<ul class="org-ul">
<li>Needs updated to reflect deprecation of <code>LoopVectorization.jl</code> in Julia 1.11</li>
</ul>
</div>
</div>
<div id="outline-container-org51dc191" class="outline-3">
<h3 id="org51dc191"><span class="section-number-3">2.5.</span> <a href="https://github.com/andrewjradcliffe/CategoricalMonteCarlo.jl">CategoricalMonteCarlo.jl</a></h3>
<div class="outline-text-3" id="text-2-5">
<p>
Ever wanted to sample from very high-dimensional joint distributions
comprised entirely of discrete, independent marginals? This package
does just that; it also offers various options for in-place
transformation.
</p>
<ul class="org-ul">
<li>Also needs updated to reflect deprecation of <code>LoopVectorization.jl</code> in Julia 1.11</li>
</ul>
</div>
</div>
<div id="outline-container-orgbf12372" class="outline-3">
<h3 id="orgbf12372"><span class="section-number-3">2.6.</span> <a href="https://github.com/andrewjradcliffe/VectorizedReduction.jl">VectorizedReduction.jl</a></h3>
<div class="outline-text-3" id="text-2-6">
<p>
Codegen for fast folds. Given the deprecation of
<code>LoopVectorization.jl</code> in Julia 1.11, it may not be worthwhile to
update this. It was great while it lasted.
</p>
</div>
</div>
<div id="outline-container-orgfb9475f" class="outline-3">
<h3 id="orgfb9475f"><span class="section-number-3">2.7.</span> <a href="https://github.com/andrewjradcliffe/RecursiveTiles.jl">RecursiveTiles.jl</a></h3>
<div class="outline-text-3" id="text-2-7">
<p>
Ever receive the following? A table comprised of flattened trees,
with:
</p>
<ul class="org-ul">
<li>parent-child relationships spanning more than one column</li>
<li>arbitrary order of columns, with no correspondence to parent-child
relationship</li>
<li>multiple flattened trees vertically concatenated into the same
table, but with unspecified begin/end</li>
</ul>
<p>
If so, welcome to my life a few years ago. This package will enable
you to roll that mess back into trees with a few lines of code.
</p>
</div>
</div>
<div id="outline-container-orgb1aa2c3" class="outline-3">
<h3 id="orgb1aa2c3"><span class="section-number-3">2.8.</span> <a href="https://github.com/andrewjradcliffe/MonteCarloSummary.jl">MonteCarloSummary.jl</a></h3>
<div class="outline-text-3" id="text-2-8">
<p>
The name says it all.
</p>
</div>
</div>
</div>

<div id="outline-container-org29abe9e" class="outline-2">
<h2 id="org29abe9e"><span class="section-number-2">3.</span> Rust crates</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org3e36fac" class="outline-3">
<h3 id="org3e36fac"><span class="section-number-3">3.1.</span> <a href="https://crates.io/lnexp">lnexp</a></h3>
<div class="outline-text-3" id="text-3-1">
<p>
Compositions of <code>log</code>, <code>log1p</code>, <code>exp</code>, and <code>expm1</code>, carefully
evaluated so as to avoid underflow/overflow.
</p>
</div>
</div>
<div id="outline-container-org9c742d2" class="outline-3">
<h3 id="org9c742d2"><span class="section-number-3">3.2.</span> <a href="https://crates.io/logsumexp">logsumexp</a></h3>
<div class="outline-text-3" id="text-3-2">
<p>
Online (1-pass) <a href="https://en.wikipedia.org/wiki/LogSumExp">LogSumExp</a> for iterators.
</p>
</div>
</div>
<div id="outline-container-org900c328" class="outline-3">
<h3 id="org900c328"><span class="section-number-3">3.3.</span> <a href="https://crates.io/gcm-lcm">gcm-lcm</a></h3>
<div class="outline-text-3" id="text-3-3">
<p>
Greatest convex minorant, least concave majorant. Useful for variety
of purposes; my interest was related to stochastic processes, but has
general applicability as a convex (or concave) function approximator.
</p>
</div>
</div>
<div id="outline-container-org675b5e6" class="outline-3">
<h3 id="org675b5e6"><span class="section-number-3">3.4.</span> <a href="https://crates.io/horner-eval">horner-eval</a></h3>
<div class="outline-text-3" id="text-3-4">
<p>
Evaluate polynomials using <a href="https://en.wikipedia.org/wiki/Horner%27s_method">Horner's method</a>. Unroll polynomials of
fixed size at compile time (and use <code>MulAdd</code>); useful if writing
numerical libraries.
</p>
</div>
</div>
</div>
</div>
</body>
</html>
